/* ১.console tab utilities API লিখে গুগলে সার্চ দাও। তারপরেও সেই সার্চ রেজাল্টে গিয়ে ৩০-৪৫ মিনিট ধরে ধরে যা যা আছে সেগুলা পড়ো।  */

/* ২.কিভাবে বুঝবে একটা বাটনে কোন একটা ইভেন্ট হ্যান্ডলার যোগ করা আছে কিনা? সেটা ডেভ টুল এর কোন কোন জায়গায় দেখা যায়। চিন্তা করে বা ডেভ টুল খুলে বের করার চেষ্টা করো। ✅*/
const btn = document.getElementById('btn')
btn.addEventListener('click', () => {
    console.log('Yeah, You clicked the button🔼')
})

/* ৩.কিভাবে তুমি console ট্যাব-এর মধ্যে কোন একটা ফাংশনকে কল করে সেই ফাংশনের প্রথম লাইনে কোড ব্রেক করে ফেলবে। অর্থাৎ সেখানে গেলে কোড অটোমেটিক বন্ধ হয়ে যাবে।ক্লিক করে কোন ব্রেক পয়েন্ট যোগ করা লাগবে না? */
const func = () => {
    console.log('Allahu Akbar')
}
// debugger
func()

/* ৪. একটা কন্ডিশনাল ব্রেক পয়েন্ট সেট করতে হয় কিভাবে? সেটা নিজে নিজে সেট করে ফেলো  */
for (let i = 1; i <= 10; i++){
    console.log(i)
}

/* ৫. accessibility কি জিনিস? ✅: Make website accessible for people having disabilities or less speed on Internet. */

/* ৬. call stack কি জিনিস? দরকার হলে গুগলে সার্চ দিয়ে শেখার চেষ্টা করো। ✅: a mechanism which keep track of the excutable function and add these to the stack. Then excutes the function from the top of the stack list  */

/* ৭. Regular এক্সপ্রেশন কি জিনিস এইটা কি কাজে লাগে? ✅: 1- Validate E-mail || 2- Search pattern */

/* ৮. Lighthouse ট্যাব দিয়ে কি করে? ✅: To recognize website's performance, accessibility, seo, speed optimization and so on. */ 


/* টাস্ক-১: */

/* ৯. সিম্পল একটা ওয়েবসাইট বানাও। সেখানে একটি ইনপুট ফিল্ডে ইমেইল লিখবে। তারপর সেটার পাশে একটা submit নামে বাটন আছে। সেই সাবমিট বাটনে চাপ দিলে রেগুলার এক্সপ্রেশন (গুগলে সার্চ দিয়ে বের করবে) দিয়ে চেক করবে এটা ভ্যালিড ইমেইল কিনা। */ 

/* ১০.ইমেইল যদি ভ্যালিড হয় তাহলে একটা গ্রীন কালার দিয়ে কোন একটা টেক্সট লিখে দিয়ে বলবে তোমার ইমেইল ঠিক আছে।আর যদি ইমেইল ঠিক না হয়। তাহলে একটা লাল কালারের টেক্সট দিয়ে বলবে।ইমেইল ঠিক নাই। ভালো করে ইমেইল দাও। */ 


/* টাস্ক-২: */

/* ১১.আমাদের গিটহাব এ issue-tracker নামে একটা রিপোজিটরি আছে।সেখানে কোন একটা issue যোগ করার পর সেটাকে close করা যায়না। আবার ডিলিট ও করা যায় না। তো তোমার কাজ হচ্ছে সেই সাইটের বাগ ফিক্স করা। */ 



/* [ এক্সট্রা হোম ওয়ার্ক ] [ আজকে না পারলে আগামীকাল করবে] */ 

/* ১২. আমাদের গিটহাব এ যাও। সেখানে ranga-store নামে একটা রিপোজটিরি আছে। সেটা ক্লোন করো। */ 

/* ১৩. সেখানেও কী কী বাগ আছে। তুমি নিজেই খুঁজে বের করার চেষ্টা করো। মিনিমাম তিনটা বাগ খুঁজে বের করে সেগুলা ফিক্স করার চেষ্টা করো। */